<h2 class="lips">Cr&eacute;ation d'un probl&egrave;me</h2>
<div class="h2_sub"></div>

<p>Ce tutoriel a pour objectif la cr&eacute;ation d'un probl&egrave;me.
Nous d&eacute;velepperons donc en plusieurs parties :
<ol>
	<li>Se rendre dans la partie ad&eacute;quate de l'administration</li>
	<li>Rappel de la pr&eacute;configuration d'un langage</li>
    <li>D&eacute;finir les informations relatives &agrave; un probl&egrave;me</li>
    <li>R&eacute;diger l'&eacute;nonc&eacute; du probl&egrave;me</li>
    <li>D&eacute;finir le code du probl&egrave;me</li>
    <li>Conseil de probl&egrave;mes similaires</li>
</ol>
</p>

<h3 class="lips">1. Se rendre dans la partie ad&eacute;quate de l'administration</h3>
<div class="h3_sub"></div>

<p><u><strong>1 <sup>&egrave;re</sup> &eacute;tape</strong></u> : <br />
Depuis la page d'accueil cliquez sur le bouton "administration"<br/>
Une fois que vous aurez cliqu&eacute; sur le bouton "administration" le plugin affichera le menu suivant : </p>

<center>
    <img src="images/accueil.png" />
    <br/><i>Image 1</i>
</center>

<p>
<u><strong>2 <sup>&egrave;me</sup> &eacute;tape</strong></u> : <br/>
Pour acc&eacute;der &agrave; la configuration du langage, il suffit maintenant de cliquer sur le menu "Prob&egrave;me"</p>

<center>
	<img src="images/menuadminproblem.png" />
    <br/><i>Image 2</i>
</center>


<h3 class="lips">2. Rappel de la pr&eacute;configuration d'un langage</h3>
<div class="h3_sub"></div>

<p>Cette premi&egrave;re partie a pour objectif de rappeler la pr&eacute;configuration du code mise en place par le cr&eacute;ateur du cours.
Ainsi vous pourrez voir &agrave; quels endroit les diff&eacute;rent morceaux de code du probl&egrave;me seront ajout&eacute;s</p>

<center>
	<img src="images/preconfig.png" />
    <br/><i>Image 3</i>
</center>

<h3 class="lips">3. D&eacute;finir les informations relatives &agrave; un probl&egrave;me</h3>
<div class="h3_sub"></div>

<center>
	<img src="images/step2.png" />
    <br/><i>Image 4</i>
</center>
La troisi&egrave;me de la cr&eacute;ation d'un probl&egrave;me sert &agrave; d&eacute;finir les informations suivantes :

<ol>
	<li>La cat&eacute;gorie du probl&egrave;me</li>
   	<li>La difficult&eacute; du probl&egrave;me</li>
    <li>Le nom du probl&egrave;me</li>
    <li>Les pr&eacute;requis pour les probl&egrave;mes</li>
</ol>

<h3 class="lips">4. R&eacute;diger l'&eacute;nonc&eacute; du probl&egrave;me</h3>
<div class="h3_sub"></div>

<p>La partie suivante concerne les r&eacute;daction de l'&eacute;nonc&eacute; du probl&egrave;me et des astuces</p>

<center>
	<img src="images/step3_enonce.png" />
    <br/><i>Image 4</i>
</center>

<p><u><strong>1 <sup>&egrave;re</sup> &eacute;tape</strong></u> : <br />
<strong>L'&eacute;nonc&eacute;</strong> : c'est la partie dans laquelle vous devez d&eacute;crire l'impl&eacute;mentation du probl&egrave;me que devra faire l'&eacute;tudiant
</p>

<p><u><strong>2 <sup>&egrave;me</sup> &eacute;tape</strong></u> : <br />
<strong>Les astuces</strong> : elles repr&eacute;sentent des indications qui pourront aider l'&eacute;tudiant dans la r&eacute;solution des probl&eacute;mes. Ce champ est optionnel
</p>

<h3 class="lips">5. D&eacute;finir le code du probl&egrave;me</h3>
<div class="h3_sub"></div>

La partie &agrave; venir d&eacute;taille les trois champs principaux que vous 

<center>
	<img src="images/step4_librairie.png" />
    <br/><i>Image 5</i>
</center>

<p><u><strong>1 <sup>&egrave;re</sup> &eacute;tape</strong></u> : <br />
D&eacute;finir les librairies &agrave; importer : la pr&eacute;configuration du langage peut mettre &agrave; disposition des librairies, cependant si les librairies propos&eacute;es ne permettent pas
de r&eacute;soudre votre probl&egrave;me, c'est dans cette partie qu'il faudra rajouter vos librairies suppl&eacute;mentaires.
</p>

<center>
	<img src="images/step5_code.png" />
    <br/><i>Image 6</i>
</center>

<p><u><strong>2 <sup>&egrave;me</sup> &eacute;tape</strong></u> : <br />
Il s'agit ici du champ utilis&eacute; pour d&eacute;finir le code qui sera affich&eacute; dans la l'&eacute;diteur de l'&eacute;tudiant pour la r&eacute;solution du probl&egrave;me.
Ce champ peut &ecirc;tre pr&eacute;rempli ou bien &ecirc;tre laiss&eacute; vide. Dans ce cas, v&ocirc;tre &eacute;non&eacute; devra &ecirc;tre assez clair pour que l'&eacute;tudiant
puisse comprendre ce qu'il devra faire<br/><br/>
Vous avez aussi la possibil&eacute; gr&acirc;ce au bouton "Comment" de placer un commentaire de type "TODO" afin d'indiquer les parties du code qui seront &agrave; impl&eacute;menter
</p>

<center>
	<img src="images/step6_tests.png" />
    <br/><i>Image 7</i>
</center>

<p><u><strong>3 <sup>&egrave;me</sup> &eacute;tape</strong></u> : <br />
La derni&egrave;re &eacute;tape de la cr&eacute;ation de code consiste &agrave; d&eacute;finir les tests qui valideront l'impl&eacute;mentation du probl&egrave;me par l'&eacute;tudiant.
Dans le but  d'assurer une validation plus s&ucirc;re de l'impl&eacute;mentation du probl&egrave;me, il est conseill&eacute; de produire plus d'un test unitaire. <br/><br/>
Afin de faire fonctionner correctement le service de compilation &agrave; distance, il est n&eacute;c&eacute;ssaire d'utiliser au moins une fois chacune des balises "True" et "False" (Fl&egrave;ches 2 et 3).
Elles permettront de faire savoir au plugin si le code ex&eacute;cut&eacute; donne le bon r&eacute;sultat ou non.<br/><br/>
Pour terminer, vous pouvez d&eacute;cider d'afficher dans la page de r&eacute;solution ou non les portions de code contenant les tests unitaires. Si vous d&eacute;cidez d'afficher une portion de code,
il suffira de s&eacute;lectionner la zone &agrave; afficher, puis de cliquer sur le bouton "Unit Test" (Fl&egrave;che 1). Par example, sur l'image 7, seulement les tests unitaires des lignes 2 et 4
seront visibles par l'&eacute;tudiant.
</p>

<h3 class="lips">6. Conseil de probl&egrave;mes similaires</h3>
<div class="h3_sub"></div>

<p>La derni&egrave;re partie de la cr&eacute;ation de probl&egrave;me. Il est possible de lier le probl&egrave;me que vous cr&eacute;ez &agrave; un ou d'autres probl&egrave;mes
que vous pourrez juger "int&eacute;ressant" pour vos &eacute;tudiants.</p>

<center>
	<img src="images/conseilpb.png" />
    <br/><i>Image 8</i>
</center>

<p><u><strong>1 <sup>&egrave;re</sup> &eacute;tape</strong></u> : <br />
Il suffit de cliquer sur le bouton "S&eacute;lectionner un probl&egrave;me", le plugin ouvrira automatiquement une fen&ecirc;netre permettant de choisir le ou les probl&egrave;mes 
&agrave; conseiller.
</p>

<center>
    <img src="images/modalconseil.pb.png" />
    <br/><i>Image 9</i>
</center>

<p><u><strong>2 <sup>&egrave;me</sup> &eacute;tape</strong></u> : <br />
Une fois la fen&ecirc;tre de s&eacute;lection ouverte, il suffit de choisir la cat&eacute;gorie du probl&egrave;me, puis le probl&egrave;me &agrave; conseiller
</p>